Revit 2024 API
Transform1D Constructor
Overload List
Name | Description
Transform1D(Double)
 Constructs the transformation by specifying the scale only.
Transform1D(Transform1D)
 The copy constructor.
Transform1D(Double, Double)
 Constructs the transformation by specifying the scale and the translation.
See Also
Transform1D Class
Transform1D Members
Autodesk.Revit.DB Namespace